In [270]:
#Let us import libraries we will use
import pandas as pd
import numpy as np

In [271]:
#Let us read the data
data = pd.read_csv('1111.csv')

In [272]:
#Let us check the data
data.head()

   Id Nigeria custum: PRICE LIST FOR MOTORCYCLE SPARE PARTS
0   1                           BRAKE STICK GN125.   750
1   2                                                NaN
2   3                                                  2
3   4                                                NaN
4   5                          BRAKE STICK CG125.    750

In [273]:
#Let us count the number of rows with '.' so that we know how many entries we have
data['Nigeria custum: PRICE LIST FOR MOTORCYCLE SPARE PARTS'].str.contains('.').value_counts()[True]

157

In [274]:
#Let us see the shape of the data

data.shape

(314, 2)

In [275]:
# Let's preview the data
data.head()

   Id Nigeria custum: PRICE LIST FOR MOTORCYCLE SPARE PARTS
0   1                           BRAKE STICK GN125.   750
1   2                                                NaN
2   3                                                  2
3   4                                                NaN
4   5                          BRAKE STICK CG125.    750

In [277]:
# Let us rename the column name to Parts
data2 = data.rename(columns={"Nigeria custum: PRICE LIST FOR MOTORCYCLE SPARE PARTS": "Parts"})

In [279]:
# Let's change the data to sting so as we can be able to easily manipulate it with python
data2.astype('str')

      Id                                        Parts
0      1                     BRAKE STICK GN125.   750
1      2                                          nan
2      3                                            2
3      4                                          nan
4      5                    BRAKE STICK CG125.    750
..   ...                                          ...
309  310   FRONT ALLOY WHEEL T BM150 BLACK.    75,000
310  311                                          nan
311  312                                           80
312  313                                          nan
313  314  FRONT ALLOY WHEEL RIM CGL125 BLACK.  75,000

[314 rows x 2 columns]

In [280]:
data2['Parts'] = data2['Parts'].str.replace(',','')
# df['x']=df['x'].str.replace(',','')

In [281]:
#Let us preview the data
data2.head()

   Id                      Parts
0   1   BRAKE STICK GN125.   750
1   2                        NaN
2   3                          2
3   4                        NaN
4   5  BRAKE STICK CG125.    750

In [283]:
#Let us make the Price column by taking the values after the '.' in the Parts column
data2['Price'] = data2['Parts'].str.split('.').str[1]
data2.head()

   Id                      Parts    Price
0   1   BRAKE STICK GN125.   750      750
1   2                        NaN      NaN
2   3                          2      NaN
3   4                        NaN      NaN
4   5  BRAKE STICK CG125.    750      750

In [285]:
#Now we will fix the Parts column since it still has prices 
# we will do this by taking the values before the '.' in the Parts column and 
# replace the value which are the prices with an empty string
for index, row in data2.iterrows():
    data2.astype('str') 
    find = data2['Price'].iloc[index]
    
    string = data2['Parts'].iloc[index]
    find = str(find) 
    string = str(string)
    go = string.replace(find, "") 
    data2['Parts'].iloc[index] = go
    
data2.head()

/Users/fredy/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

   Id               Parts    Price
0   1  BRAKE STICK GN125.      750
1   2                          NaN
2   3                   2      NaN
3   4                          NaN
4   5  BRAKE STICK CG125.      750

In [286]:
#Now we will remove the rows we do not need by droping rows whose string in Parts column is less than 3 characters
#since this will mean the particular column is not a valid part 
data2 = data2[data2['Parts'].str.len()>=3]
data2.head()

    Id                  Parts      Price
0    1     BRAKE STICK GN125.        750
4    5     BRAKE STICK CG125.        750
7    8     BRAKE STICK BM150.       1200
11  12  BRAKE  STICK  TVSHLX.       1200
15  16   OIL COOLER CG125/GN.       2000

In [291]:
#Now we will export our data to a csv file
csv_data = data2.to_csv('1113.csv', index=False)